---
title: ViewOrientation3D
classe: Autodesk.Revit.DB.ViewOrientation3D
namespace: Autodesk.Revit.DB
eredita: System.Object
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 5
---

# ViewOrientation3D

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `XYZ EyePosition { get; }` | `viewOrientation3D.EyePosition` | XYZ |
| `XYZ ForwardDirection { get; }` | `viewOrientation3D.ForwardDirection` | XYZ |
| `Boolean IsValidObject { get; }` | `viewOrientation3D.IsValidObject` | Boolean |
| `XYZ UpDirection { get; }` | `viewOrientation3D.UpDirection` | XYZ |
| `Void Dispose()` | `viewOrientation3D.Dispose()` | Void |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```